Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеЗапасов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаРасходы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеЗапасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура пр_ПриОткрытииПосле(Отказ)
	
	пр_УправлениеВидимостьюЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура пр_ВидОперацииПриИзмененииПосле(Элемент)
	
	пр_УправлениеВидимостьюЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура пр_ЗапасыПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 	
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетЗатрат) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.СчетЗатрат = пр_ПереходНаУНФВызовСервера.СчетУчетаЗатратНоменклатуры(ТекущиеДанные.Номенклатура);	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Добавление в табличную часть "Запасы" Поля "СчетЗатрат"
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Запасы);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Запасы.СчетЗатрат");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Счет затрат");
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ЗапасыСчетЗатрат");
	
	// Переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ГруппаЛево);
		
КонецПроцедуры

&НаКлиенте
Процедура пр_УправлениеВидимостьюЭлементовФормы()
	
	Элементы.ЗапасыСчетЗатрат.Видимость = 
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы");
	
КонецПроцедуры

#КонецОбласти
